Tekla Open API Reference for Tekla Structures 2025
LoftedPlate.Insert Method
 Inserts the lofted plate into the model database. All the attributes must be set and there must be at minimum 2 base curves.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public override bool Insert()
Public Overrides Function Insert As Boolean
Return Value
Type: Boolean
True on success.
Exceptions
Exception | Condition
LoftedPlateOperationException |  Thrown if the input base curves would yield an invalid lofted plate. The most derived type of the exception can be used to retrieve the actual source of error.
See Also
Reference
LoftedPlate Class
Tekla.Structures.Model Namespace